[
  {
    "title": "Seattle AI & ML Meetup",
    "description": "Join us for an evening of artificial intelligence and machine learning discussions in downtown Seattle. We'll cover the latest trends in deep learning, real-world AI applications, and best practices for model deployment. Our guest speaker will share insights on responsible AI and ethical considerations. There will be time for Q&A and networking with local practitioners. Refreshments and light snacks will be provided.",
    "location": "Seattle Central Library, 1000 4th Ave, Seattle, WA 98104",
    "topic": "AI/ML",
    "start_time": "2025-12-03T18:00:00-08:00",
    "end_time": "2025-12-03T20:00:00-08:00",
    "url": "https://example.com/seattle-ai-ml-meetup",
    "presenting": false,
    "talk_title": ""
  },
  {
    "title": "Bellevue Cloud Computing Roundtable",
    "description": "This meetup brings together cloud architects and developers to discuss multi-cloud strategies and serverless architectures. We'll have a panel on cloud cost optimization and a hands-on demo on deploying microservices. Attendees will share their experiences with AWS, Azure, and GCP. The event will close with a group discussion on cloud security best practices. All skill levels are welcome.",
    "location": "Bellevue City Hall, 450 110th Ave NE, Bellevue, WA 98004",
    "topic": "Cloud Computing",
    "start_time": "2025-12-10T17:30:00-08:00",
    "end_time": "2025-12-10T19:30:00-08:00",
    "url": "https://example.com/bellevue-cloud-roundtable",
    "presenting": true,
    "talk_title": "Scaling Serverless in Production"
  },
  {
    "title": "Redmond IoT Innovators Night",
    "description": "Explore the future of the Internet of Things at our Redmond meetup. We'll showcase new IoT hardware, discuss edge computing, and hear from a startup founder building smart home devices. Attendees can participate in a live sensor coding challenge. The night ends with networking and pizza. Bring your IoT project ideas!",
    "location": "Redmond Community Center, 6505 176th Ave NE, Redmond, WA 98052",
    "topic": "IoT",
    "start_time": "2025-12-12T18:30:00-08:00",
    "end_time": "2025-12-12T20:30:00-08:00",
    "url": "https://example.com/redmond-iot-night",
    "presenting": false,
    "talk_title": ""
  },
  {
    "title": "Kirkland Frontend Developers Social",
    "description": "Frontend engineers and designers are invited to connect and share the latest in web development. We'll have lightning talks on React 18, CSS-in-JS, and accessibility testing. The event includes a hands-on workshop for building progressive web apps. Attendees can join a roundtable on UI/UX trends for 2025. Drinks and snacks will be available.",
    "location": "Google Kirkland, 747 6th St S, Kirkland, WA 98033",
    "topic": "Frontend",
    "start_time": "2025-12-17T18:00:00-08:00",
    "end_time": "2025-12-17T20:00:00-08:00",
    "url": "https://example.com/kirkland-frontend-social",
    "presenting": true,
    "talk_title": "Modern CSS for Scalable Apps"
  },
  {
    "title": "Seattle Cybersecurity Forum",
    "description": "Security professionals and enthusiasts gather to discuss the latest threats and defenses in the cybersecurity landscape. We'll cover zero trust architectures, incident response, and the impact of AI on security. There will be a live demo of a penetration test and a panel on career growth in cybersecurity. Network with local CISOs and security engineers. Light refreshments provided.",
    "location": "Columbia Center, 701 5th Ave, Seattle, WA 98104",
    "topic": "Cybersecurity",
    "start_time": "2026-01-09T17:00:00-08:00",
    "end_time": "2026-01-09T19:30:00-08:00",
    "url": "https://example.com/seattle-cyber-forum",
    "presenting": false,
    "talk_title": ""
  },
  {
    "title": "Renton Data Science Symposium",
    "description": "Join data scientists and analysts for a night of machine learning, data visualization, and big data infrastructure. The symposium will feature a keynote on ethical data use and a workshop on building dashboards with Python. Attendees can participate in a Kaggle-style mini competition. The event will close with a networking mixer. Bring your data questions!",
    "location": "Renton Technical College, 3000 NE 4th St, Renton, WA 98056",
    "topic": "Data Science",
    "start_time": "2026-01-12T18:00:00-08:00",
    "end_time": "2026-01-12T20:30:00-08:00",
    "url": "https://example.com/renton-data-symposium",
    "presenting": true,
    "talk_title": "Building Dashboards with Python"
  },
  {
    "title": "Bothell Blockchain & Web3 Meetup",
    "description": "Blockchain developers and crypto enthusiasts meet to discuss decentralized apps and smart contracts. We'll have a hands-on session on writing Solidity code and a panel on the future of NFTs. Attendees can demo their DeFi projects and join a group discussion on regulatory trends. Pizza and drinks provided for all participants.",
    "location": "UW Bothell, 18115 Campus Way NE, Bothell, WA 98011",
    "topic": "Blockchain",
    "start_time": "2026-01-21T18:30:00-08:00",
    "end_time": "2026-01-21T20:30:00-08:00",
    "url": "https://example.com/bothell-blockchain-meetup",
    "presenting": false,
    "talk_title": ""
  },
  {
    "title": "Shoreline VR/AR Experience Night",
    "description": "Experience the latest in virtual and augmented reality at our interactive Shoreline meetup. Try out new VR headsets, learn about AR development, and hear from local VR game studios. We'll have a panel on the future of immersive tech and a hands-on Unity workshop. The evening ends with a networking session for VR/AR creators.",
    "location": "Shoreline Community College, 16101 Greenwood Ave N, Shoreline, WA 98133",
    "topic": "VR/AR",
    "start_time": "2026-01-23T17:30:00-08:00",
    "end_time": "2026-01-23T19:30:00-08:00",
    "url": "https://example.com/shoreline-vrar-night",
    "presenting": false,
    "talk_title": ""
  },
  {
    "title": "West Seattle Robotics Expo",
    "description": "Robotics hobbyists and engineers gather to showcase their latest projects and compete in a robot battle. We'll have workshops on Arduino programming, autonomous navigation, and 3D printing for robotics. The expo features a keynote on robotics in education and a Q&A with local makerspace leaders. All ages and experience levels are welcome.",
    "location": "West Seattle High School, 3000 California Ave SW, Seattle, WA 98116",
    "topic": "Robotics",
    "start_time": "2026-02-04T18:00:00-08:00",
    "end_time": "2026-02-04T20:30:00-08:00",
    "url": "https://example.com/westseattle-robotics-expo",
    "presenting": true,
    "talk_title": "3D Printing for Robotics"
  },
  {
    "title": "Capitol Hill DevOps Night",
    "description": "DevOps engineers and SREs are invited to Capitol Hill for talks on CI/CD pipelines, container orchestration, and infrastructure as code. The meetup includes a live demo of Kubernetes troubleshooting and a roundtable on DevOps career paths. Attendees can join a hands-on session with Terraform and Ansible. Food and beverages provided.",
    "location": "WeWork Capitol Hill, 1525 11th Ave, Seattle, WA 98122",
    "topic": "DevOps",
    "start_time": "2026-02-13T18:00:00-08:00",
    "end_time": "2026-02-13T20:00:00-08:00",
    "url": "https://example.com/capitolhill-devops-night",
    "presenting": false,
    "talk_title": ""
  }
]
